load-test-results/2025-06-08_test_3/20250608_182350_gateway_fast_heavy.txt
Running 1m test @ http://localhost:3000/fast
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us    -nan%
    Req/Sec     5.51      4.93    30.00     84.53%
  1087 requests in 1.00m, 194.25KB read
  Socket errors: connect 0, read 0, write 0, timeout 1087
Requests/sec:     18.09
Transfer/sec:      3.23KB