load-test-results/2025-06-08_test_3/20250608_182350_gateway_fast_medium.txt
Running 1m test @ http://localhost:3000/fast
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.88s   117.79ms   2.00s    87.50%
    Req/Sec     7.67      6.15    40.00     81.52%
  1144 requests in 1.00m, 204.45KB read
  Socket errors: connect 0, read 0, write 0, timeout 1096
Requests/sec:     19.04
Transfer/sec:      3.40KB