load-test-results/2025-06-08_test_3/20250608_182350_gateway_slow.txt
Running 30s test @ http://localhost:3000/slow?delay=50
  4 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.21s   170.47ms   1.97s    78.03%
    Req/Sec     7.43      6.11    30.00     78.92%
  581 requests in 30.04s, 103.26KB read
  Socket errors: connect 0, read 0, write 0, timeout 3
Requests/sec:     19.34
Transfer/sec:      3.44KB